Autodesk.Revit.DB.VisibleInViewFilter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Boolean)
Constructs a new instance of a VisibleInViewFilter, with the option to pass all non-visible elements.
document:
The document that owns the view.
viewId:
The view id.
inverted:
True if the filter should match all elements not visible in the given view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.VisibleInViewFilter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a new instance of a VisibleInViewFilter.
document:
The document that owns the view.
viewId:
The view id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.VisibleInViewFilter
A quick filter that passes elements that are most likely visible in the given view.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
In some situations (for example, when the element geometry is not yet calculated for the input view)
this filter may return true even though the element may not actually be visible when geometry is calculated.
Since:
2021